Repository: artemanufrij/hashme
Catalog: po/*.po
Languages: pt

source: Calculating checksum…
pt: A calcular checksum…

source: Open a file
pt: Abrir um ficheiro

source: Choose an algorithm
pt: Escolha um algoritmo

source: (optional) paste a reference hash here…
pt: (opcional) cole uma referência de hash aqui…

source: Choose a file or drag one onto this window…
pt: Escolha um ficheiro ou arraste-o para dentro desta janela…

source: Copy result…
pt: Copiar resultado…

source: Open
pt: Abrir

source: _Cancel
pt: _Cancelar

source: _Open
pt: _Abrir

source: All files
pt: Todos os ficheiros

source: Generate and verify file hashes
pt: Gerar e verificar hashes do ficheiro

source: A tool that allows you to ensure a file hasn't become corrupted by comparing its hashsum
pt: Uma ferramenta que permite verificar se um ficheiro ficou corrompido comparando-o com o seu hashsum

source: Verify files with a reference hash to ensure the integrity of files
pt: Verifica ficheiros com uma referência de hash para garantir a integridade dos mesmo

source: Generate file hashes to allow yourself and others to verify file integrity
pt: Gera hashes de ficheiros que permite a si e a outros verificar a integridade dos mesmos

source: Supports SHA256, SHA1 and MD5 algorithms
pt: Suporta algoritmos SHA256, SHA1 e MD5

source: Update French (by NathanBnm)
pt: Atualização do Francês (por NathanBnm)

source: New:
pt: Novo:

source: Switch to meson
pt: Alteração para o meson

source: Translation:
pt: Tradução:

source: Dutch (by Heimen Stoffels)
pt: Holandês (por Heimen Stoffels)

source: Lithuanian (by welaq)
pt: Lituano (por welaq)

source: Norwegian Bokmål (by Harald H)
pt: Bokmål Norueguesa (por Harald H)

source: Improved:
pt: Melhorias:

source: Some descriptions (by aljelly)
pt: Algumas descrições (por aljelly)

source: Fix:
pt: Correções:

source: ignore case insensitive for equal result and reference
pt: ignora maiúsculas e minúsculas para um resultado e referência igual

source: Polish (by DanyGee)
pt: Polaco (por DanyGee)

source: File choosing
pt: Escolha de ficheiros

source: Flat style
pt: Estilo plano

source: Icon
pt: Ícone

source: Czech (by Daniel Zvir)
pt: Checo (por Daniel Zvir)
